Repository: mirespace/dotnet6
Catalog: src/fsharp/vsintegration/src/FSharp.LanguageService.*/xlf/Microsoft.VisualStudio.Package.LanguageService.*.xlf
Languages: cs, de, es, fr, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# BraceMatchStatus
source: Matches: {0}
cs: Počet shod: {0}
de: Übereinstimmungen: {0}
es: Coincidencias: {0}
fr: Correspondances : {0}
ja: 一致項目: {0}
ko: 일치 항목: {0}
pt_br: Correspondências: {0}
ru: Соответствий: {0}
tr: Eşleşmeler: {0}
zh_hans: 匹配: {0}
zh_hant: 相符項目: {0}

# BufferChanged
source: The buffer has changed since the EditArray was created, so edits cannot be applied.
cs: Vyrovnávací paměť se od vytvoření objektu EditArray změnila, takže nejde aplikovat změny.
de: Der Puffer wurde seit dem Erstellen von EditArray geändert, daher können Bearbeitungen nicht übernommen werden.
es: El búfer ha cambiado desde que se creó EditArray; no se pueden aplicar las ediciones.
fr: La mémoire tampon a été modifiée depuis la création de EditArray ; par conséquent, les modifications ne peuvent pas être appliquées.
ja: EditArray が作成されて以来バッファーが変更されています。編集を適用できません。
ko: EditArray를 만든 이후 버퍼가 변경되었으므로 편집 내용을 적용할 수 없습니다.
pt_br: O buffer foi alterado desde a criação de EditArray, portanto, as edições não podem ser aplicadas.
ru: Буфер изменился после создания массива EditArray, поэтому применение изменений невозможно.
tr: Arabellek, EditArray'in oluşturulmasından sonra değişti, bu yüzden düzenlemeler uygulanamıyor.
zh_hans: 自创建 EditArray 后缓冲区已发生更改，因此无法应用所做的编辑。
zh_hant: 緩衝區在建立 EditArray 之後已經變更，因此無法套用編輯。

# ComboMembersTip
source: Members
cs: Členové
de: Mitglieder
es: Miembros
fr: Membres
ja: メンバー
ko: 멤버
pt_br: Membros
ru: Элементы
tr: Üyeler
zh_hans: 成员
zh_hant: 成員

# ComboTypesTip
source: Types
cs: Typy
de: Typen
es: Tipos
ja: 型
ko: 형식
pt_br: Tipos
ru: Типы
tr: Türler
zh_hans: 类型
zh_hant: 型別

source: Comment Selection
cs: Výběr komentáře
de: Kommentar für Auswahl
es: Selección con comentarios
fr: Commenter la sélection
ja: 選択範囲のコメント
ko: 선택 영역을 주석으로 처리
pt_br: Comentar Seleção
ru: Закомментировать выделенный фрагмент
tr: Seçimi Açıklama Satırı Yap
zh_hans: 注释选定内容
zh_hant: 註解選取範圍

# EditIntersects
source: Existing edit number {0} intersects 'editSpan' argument.
cs: Existující číslo úpravy {0} protíná argument editSpan.
de: Die vorhandene Bearbeitungsnummer {0} überschneidet sich mit dem editSpan-Argument.
es: El número de ediciones existente ({0}) interfiere con el argumento 'editSpan'.
fr: Le numéro de modification existant {0} entre en intersection avec l'argument 'editSpan'.
ja: 既存の編集番号 {0} は 'editSpan' 引数と共通部分があります。
ko: 기존 편집 번호 {0}이(가) 'editSpan' 인수와 교차합니다.
pt_br: O número de edição existente {0} intersecciona com o argumento "editSpan".
ru: Существующий номер изменения {0} перекрывает аргумент editSpan.
tr: Varolan düzenleme numarası {0}, 'editSpan' bağımsız değişkeni ile kesişiyor.
zh_hans: 现有的编辑编号 {0} 与“editSpan”参数交叉。
zh_hant: 現有的編輯號碼 {0} 與 'editSpan' 引數相交。

source: Format Span
cs: Formátování rozsahu
de: Abschnitt formatieren
es: Intervalo de formato
fr: Mettre en forme l'espacement
ja: スパンのフォーマット
ko: 형식 범위
pt_br: Formatar Alcance
ru: Форматировать интервал
tr: Yayılımı Biçimlendir
zh_hans: 格式范围
zh_hant: 格式延伸

# MaxErrorsReached
source: The maximum number of errors or warnings has been reached.
cs: Dosáhlo se maximálního počtu chyb nebo upozornění.
de: Die maximale Anzahl von Fehlern oder Warnungen wurde erreicht.
es: Se alcanzó el número máximo de errores o advertencias.
fr: Le nombre maximal d'erreurs ou d'avertissements est atteint.
ja: エラーまたは警告の数が最大数を超えました。
ko: 오류 또는 경고의 최대 개수에 도달했습니다.
pt_br: O número máximo de erros ou avisos foi atingido.
ru: Достигнуто максимальное число ошибок и предупреждений.
tr: En yüksek hata veya uyarı sayısına ulaşıldı.
zh_hans: 已达到最大错误数或警告数。
zh_hant: 已達錯誤或警告最大數目。

# NoExpansionSession
source: There is no active expansion session.
cs: Neexistuje žádná aktivní relace rozšíření.
de: Es ist keine aktive Erweiterungssitzung vorhanden.
es: No hay sesión de expansión activa.
fr: Il n'y a pas de session d'expansion active.
ja: 実行中の展開セッションはありません。
ko: 활성 확장 세션이 없습니다.
pt_br: Não há sessão de expansão ativa.
ru: Нет активного сеанса расширения.
tr: Etkin genişletme oturumu yok.
zh_hans: 没有活动的扩展会话。
zh_hant: 沒有使用中的擴充工作階段。

source: Uncomment Selection
cs: Odkomentovat výběr
de: Kommentar aus Auswahl entfernen
es: Selección sin comentarios
fr: Annuler le commentaire de la sélection
ja: 選択範囲のコメントを解除
ko: 선택 영역의 주석 처리 제거
pt_br: Remover Comentários da Seleção
ru: Раскомментировать выделенный фрагмент
tr: Seçimi İşletilir Koda Çevir
zh_hans: 取消注释选定内容
zh_hant: 取消註解選取範圍

# UnsupportedFormat
source: The file cannot be opened with the selected editor. Please choose another editor.
cs: Soubor se nedá otevřít v tomto editoru. Zvolte jiný editor.
de: Die Datei kann im ausgewählten Editor nicht geöffnet werden. Wählen Sie einen anderen Editor aus.
es: No se puede abrir el archivo con el editor seleccionado. Elija otro editor.
fr: Impossible d'ouvrir le fichier à l'aide de l'éditeur sélectionné. Choisissez un autre éditeur.
ja: 選択されたエディターを使用してファイルを開けません。別のエディターを選択してください。
ko: 파일을 선택한 편집기로 열 수 없습니다. 다른 편집기를 선택하세요.
pt_br: O arquivo não pode ser aberto com o editor selecionado. Escolha outro editor.
ru: Невозможно открыть файл с помощью выбранного редактора. Выберите другой редактор.
tr: Dosya seçilen düzenleyici ile açılamadı. Lütfen başka bir düzenleyici seçin.
zh_hans: 无法使用所选编辑器打开该文件。请选择其他编辑器。
zh_hant: 無法用選取的編輯器開啟檔案。請選擇另一個編輯器。

# TemplateNotPrepared
source: PrepareTemplate has not been called.
cs: Metoda PrepareTemplate se nevolala.
de: PrepareTemplate wurde nicht aufgerufen.
es: No se ha llamado a PrepareTemplate.
fr: PrepareTemplate n'a pas été appelé.
ja: PrepareTemplate が呼び出されていません。
ko: PrepareTemplate이 호출되지 않았습니다.
pt_br: PrepareTemplate não foi chamado.
ru: Метод PrepareTemplate не был вызван.
tr: PrepareTemplate çağrılmadı.
zh_hans: 尚未调用 PrepareTemplate。
zh_hant: 尚未呼叫 PrepareTemplate。

# UnknownBuffer
source: IVsTextLines buffer does not match the expected buffer
cs: Vyrovnávací paměť IVsTextLines se neshoduje s očekávanou vyrovnávací pamětí.
de: Der Puffer für IVsTextLines entspricht nicht dem erwarteten Puffer.
es: El búfer de IVsTextLines no coincide con el búfer esperado.
fr: La mémoire tampon de IVsTextLines ne correspond pas à la mémoire tampon attendue
ja: IVsTextLines バッファーが予期されたバッファーと一致しません。
ko: IVsTextLines 버퍼가 예상 버퍼와 일치하지 않습니다.
pt_br: O buffer IVsTextLines não corresponde ao buffer esperado
ru: Буфер IVsTextLines не соответствует требуемому буферу
tr: IVsTextLines arabelleği beklenen arabellekle eşleşmiyor
zh_hans: IVsTextLines 缓冲区与所需缓冲区不匹配
zh_hant: IVsTextLines 緩衝區與預期的緩衝區不相符

# UnrecognizedFilterFormat
source: Unrecognized filter format: {0}
cs: Nedá se rozpoznat formát filtru: {0}.
de: Nicht erkanntes Filterformat: {0}
es: Formato de filtro no reconocido: {0}
fr: Format de filtre non reconnu : {0}
ja: 認識されないエンコード形式です: {0}
ko: 인식할 수 없는 필터 형식: {0}
pt_br: Formato de filtro não reconhecido: {0}
ru: Неопознанный формат фильтра: {0}
tr: Tanınmayan filtre biçimi: {0}
zh_hans: 无法识别的筛选器格式: {0}
zh_hant: 無法辨認的篩選格式: {0}
