Repository: mirespace/dotnet6
Catalog: src/deployment-tools/src/Microsoft.Deployment.DotNet.Releases/src/xlf/ReleasesResources.*.xlf
Languages: de

# FileNotFound
source: Could not find the specified file: {0}
de: Die angegebene Datei wurde nicht gefunden: {0}

# HashMismatch
source: The expected hash ({0}) and actual hash ({1}) for {2} do not match.
de: Der erwartete Hash ({0}) und der tatsächliche Hash ({1}) für "{2}" stimmen nicht überein.

# InvalidBuildMetadata
source: The build metadata value is invalid: {0}
de: Der Metadatenwert für den Build ist ungültig: {0}

# InvalidMajorVersion
source: Invalid or missing major version.
de: Ungültige oder fehlende Hauptversion.

# InvalidMinorVersion
source: Invalid or missing minor version.
de: Ungültige oder fehlende Nebenversion.

# InvalidPatch
source: Invalid or missing patch version.
de: Ungültige oder fehlende Patchversion.

# InvalidPrerelease
source: The prerelease value is invalid: {0}
de: Der Wert für die Vorabversion ist ungültig: {0}

# InvalidVersion
source: Invalid version: {0}
de: Ungültige Version: {0}

source: Value cannot be empty.
de: Der Wert darf nicht leer sein.

# VersionPartLessThanZero
source: The '{0}' value cannot be less than 0.
de: Der Wert für "{0}" darf nicht unter 0 liegen.
