Repository: mirespace/dotnet6
Catalog: src/fsharp/vsintegration/src/FSharp.LanguageService/xlf/VSPackage.*.xlf
Languages: de

source: Excluded Code
de: Ausgeschlossener Code

source: Preprocessor Keyword
de: Präprozessor-Schlüsselwort

# FSharpFile
source: F# File (*.fs)
de: F#-Datei (*.fs)

# FSharpInterfaceFile
source: F# Interface File (*.fsi)
de: F#-Schnittstellendatei (*.fsi)

# FSXFile
source: F# Script File (*.fsx)
de: F#-Skriptdatei (*.fsx)

# FSharpScriptFile
source: F# Script File (*.fsscript)
de: F#-Skriptdatei (*.fsscript)

source: Comment
de: Kommentar

source: Identifier
de: Bezeichner

source: Keyword
de: Schlüsselwort

source: Number
de: Zahl

source: String
de: Zeichenfolge
